# Найдите сумму цифр трехзначного числа.

a = int(input('Первое число: '))
b = int(input('Второе число: '))
c = int(input('Третье число: '))

print('Сумма этого числа: ', a+b+c)