# Напишите программу, которая на вход принимает два числа A и B, и возводит число А в целую степень B с помощью рекурсии.

# def nums(m, n):
#     if m == 0:
#         return n
#     return nums(m-1, n+1)

# n, m = int(input()), int(input())
# print(nums(m, n))
