# В фермерском хозяйстве в Карелии выращивают чернику. Она растет на
# круглой грядке, причем кусты высажены только по окружности. Таким образом, у
# каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
# выросло различное число ягод – на i-ом кусте выросло ai
#  ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым
# кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может
# собрать за один заход собирающий модуль, находясь перед некоторым кустом
# заданной во входном файле грядки.

from random import randint

n = int(input('Колличество грядок: '))
list_n = [randint(1, 10) for _ in range(n)]
print(list_n)
m = 0
for i in range(len(list_n)):
    if list_n[i] != list_n[-1]:
        m = max(m, list_n[i-1] + list_n[i] + list_n[i+1])
    else:
        m = max(m, list_n[i-1] + list_n[i] + list_n[0])
print(m)